In [63]:
import numpy as np

In [64]:
import pandas as pd

In [65]:
df = pd.read_csv('mpg.csv')

In [66]:
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304.0,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302.0,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86,2790,15.6,82,1,ford mustang gl
394,44.0,4,97.0,52,2130,24.6,82,2,vw pickup
395,32.0,4,135.0,84,2295,11.6,82,1,dodge rampage
396,28.0,4,120.0,79,2625,18.6,82,1,ford ranger
397,31.0,4,119.0,82,2720,19.4,82,1,chevy s-10

In [67]:
test1 = df.groupby('model_year').mean()

test1['mpg']

model_year
70    17.689655
71    21.250000
72    18.714286
73    17.100000
74    22.703704
75    20.266667
76    21.573529
77    23.375000
78    24.061111
79    25.093103
80    33.696552
81    30.334483
82    31.709677
Name: mpg, dtype: float64

I wanted to practice how to create an array with just the model year and MPG. This is the result ^. I'm not too sure how to get it to look like a nice table (data frame), the result is instead this crap.

In [68]:
test2 = df[['model_year', 'mpg']]

In [69]:
test2 = test2.groupby('model_year').mean()
test2

                  mpg
model_year
70          17.689655
71          21.250000
72          18.714286
73          17.100000
74          22.703704
75          20.266667
76          21.573529
77          23.375000
78          24.061111
79          25.093103
80          33.696552
81          30.334483
82          31.709677

Ok, so here's how you get it to actually look nice. Now it's a dataframe rather than a list

In [70]:
df['model_year']

0      70
1      70
2      70
3      70
4      70
       ..
393    82
394    82
395    82
396    82
397    82
Name: model_year, Length: 398, dtype: int64

The next cell came from meeting with Patrick to discuss data science, and he told me about the .agg() call

use .agg(set) for unique values and .agg(list) for every value

In [71]:
df.groupby('model_year')['mpg'].agg(set)

model_year
70    {9.0, 10.0, 11.0, 14.0, 15.0, 16.0, 17.0, 18.0...
71    {35.0, 12.0, 13.0, 14.0, 16.0, 17.0, 18.0, 19....
72    {11.0, 12.0, 13.0, 14.0, 15.0, 17.0, 18.0, 19....
73    {11.0, 12.0, 13.0, 14.0, 15.0, 16.0, 18.0, 19....
74    {32.0, 13.0, 14.0, 15.0, 16.0, 18.0, 19.0, 20....
75    {33.0, 13.0, 14.0, 15.0, 16.0, 17.0, 18.0, 19....
76    {13.0, 14.5, 15.5, 16.0, 17.5, 18.0, 18.5, 20....
77    {15.5, 15.0, 17.5, 17.0, 19.0, 20.5, 18.5, 16....
78    {16.2, 17.7, 18.6, 19.9, 19.4, 20.2, 19.2, 20....
79    {26.8, 28.4, 28.8, 15.5, 16.5, 17.0, 17.6, 19....
80    {19.1, 23.7, 24.3, 23.6, 26.4, 27.9, 28.0, 29....
81    {17.6, 20.2, 22.4, 23.5, 30.7, 25.8, 26.6, 27....
82    {32.0, 34.0, 36.0, 37.0, 38.0, 44.0, 22.0, 23....
Name: mpg, dtype: object

In [72]:
test3 = test2['mpg'].astype(int)
pd.DataFrame(test3)

            mpg
model_year
70           17
71           21
72           18
73           17
74           22
75           20
76           21
77           23
78           24
79           25
80           33
81           30
82           31

In [73]:
test3.set_index('model_year')

AttributeError: 'Series' object has no attribute 'set_index'

Now it's back to being a messed up list instead of a nice dataframe.

----------------------------

Let's see if I can do this from the top now

In [ ]:
df = pd.read_csv('mpg.csv')

In [ ]:
df

In [ ]:
df2 = df[['model_year','mpg']]

In [ ]:
df2 = df2.groupby('model_year').mean('mpg').round(1)

In [ ]:
df2

Cool, I did it. I'm still not sure how to get rid of the last .x digit. I can turn it into a zero, and there's probably a good way of doing it, but I'm not too sure yet.

In [ ]:
df

In [ ]:
df['model_year'].unique()

In [ ]:
df['model_year'].value_counts()

In [ ]:
df.groupby('model_year')

This is a 'lazy function' because nothing has actually happened yet. Pandas is waiting for me to pass a .mean(), .sum() call, etc.

In [ ]:
df.groupby('model_year').mean()

In [ ]:
df['weight'].max()

Just practicing how to find the max in a column . . .

In [ ]:
df.groupby('model_year').mean()['mpg']

In [ ]:
df3 = df.groupby('model_year').mean().round(0)['mpg']
pd.DataFrame(df3)

This is another way of doing what I was doing earlier

In [ ]:
df.groupby(['model_year','cylinders']).mean()

This is a multi-level or hirearchy index. I've also seen this refered to as a a multindex dataframe

Model year and cylinders are not column names, they're indexes

In [ ]:
df.groupby(['model_year','cylinders']).mean().columns

In [ ]:
df4 = pd.DataFrame(df.groupby(['model_year','cylinders']).mean().round(1)['mpg'])

In [ ]:
df4.head()

once again, just testing. I'm not sure if this is a good way of going about it. Maybe I'll ask Patrick.

In [ ]:
df4.head()

In this example ^, the main grouping method is model year. Once mpg has been grouped by the model year, it's then grouped by number of cylinders within the model year.

In [ ]:
df.groupby(['model_year', 'cylinders']).mean().index

As is shown, this is a MultiIndex, and these are the two indeces

In [ ]:
df.groupby(['model_year', 'cylinders']).mean().columns

In [ ]:
df.groupby('model_year').describe()

In [ ]:
df.groupby('model_year').describe().transpose().round(2)

I guess it really depends on which variables you're looking at as far as whether you'd want to use .transpose()

You get the same data either way, but I find it much clearer in this case to use .transpose() since you get all the stats like mpg, cylinders etc. clearly broken up

In [82]:
year_cyl = df.groupby(['model_year', 'cylinders']).mean().round(1)
year_cyl.head(4)

                       mpg  displacement  weight  acceleration  origin
model_year cylinders
70         4          25.3         107.0  2292.6          16.0     2.3
           6          20.5         199.0  2710.5          15.5     1.0
           8          14.1         367.6  3940.1          11.2     1.0
71         4          27.5         101.8  2056.4          17.0     1.9

An interesting point: if I call df.head(n), n does not correspond to n of model_year, it corresponds to n rows of cylinders, mpg, etc.

Another interesting point: I was trying to remember how to find specific rows, and I was trying to use .head([3:5]) in order to do that. I remember now that you have to use .iloc[3:5]

Even if df.head() could do that, the syntax is with () not ([]), but whatever

In [83]:
year_cyl.index.names

FrozenList(['model_year', 'cylinders'])

In [84]:
year_cyl.index.levels

FrozenList([[70, 71, 72, 73, 74, 75, 76, 77, 78, 79, 80, 81, 82], [3, 4, 5, 6, 8]])

The above cell is showing all possible results for model_year and for cylinders

In [91]:
year_cyl.loc[70]

            mpg  displacement  weight  acceleration  origin
cylinders
4          25.3         107.0  2292.6          16.0     2.3
6          20.5         199.0  2710.5          15.5     1.0
8          14.1         367.6  3940.1          11.2     1.0

The above call applies the .loc[] to the outermost layer of the index. Since the outermost layer is model_year, it is showing the entire table for year_cyl where the model year is 70

----------------------------

If I want to single out just 4 cylinder cars from 1970, how do I do that? Let's see . . .

In [95]:
year_cyl[[year_cyl.loc[70].loc[4]]

SyntaxError: unexpected EOF while parsing (2942296494.py, line 1)

Clearly this does not work. I can't just pass in .loc[70] to get the year 1970 within a larger .loc[4] in order to get 4 cylinder cars from 1970

In [101]:
year_cyl.loc[70].loc[4]

mpg               25.3
displacement     107.0
weight          2292.6
acceleration      16.0
origin             2.3
Name: 4, dtype: float64

Ahh, yes. The answer is surprisingly simple. You simply tack on another .loc[] to the fist one, and you don't have to do any janky nesting of code.

In [104]:
year_cyl.loc[[70, 82]]

                       mpg  displacement  weight  acceleration  origin
model_year cylinders
70         4          25.3         107.0  2292.6          16.0     2.3
           6          20.5         199.0  2710.5          15.5     1.0
           8          14.1         367.6  3940.1          11.2     1.0
82         4          32.1         118.6  2402.3          16.7     1.7
           6          28.3         225.0  2931.7          16.0     1.0

You can pass in more than one argument for model_year and get back multiple model years. If you want to find all 4 cylinder cars from 1970 and 1982, the method I used earlier doesn't work:

In [108]:
#year_cyl.loc[[70, 82]].loc[4]

This is despite the fact that there are 4 cylinder cars for both model years. I think if you wanted to find this information, you'd probably be better off just going back to the original table instead of trying to work around the limitations of a MultiIndex. Just for practice, I'll try to find information for 4 cylinder cars from 1970 and 1982:

In [121]:
cyl4 = df[['cylinders', 'model_year']]
cyl4.head(4)

   cylinders  model_year
0          8          70
1          8          70
2          8          70
3          8          70

In [129]:
#cyl4_1 = cyl4['model_year'] == 70 or 82 and cyl4['cylinders'] == 4

Clearly this is not the right method for doing this, and cyl4_1 isn't a good variable name anyway, since it's confusing, I only used it for the sake of the test

In [138]:
cyl4[((cyl4['model_year'] == 70) | (cyl4['model_year'] == 82) & cyl4['cylinders'] == 4)]

Empty DataFrame
Columns: [cylinders, model_year]
Index: []

This approach also doesn't work . . .

In [147]:
cyl4_types = cyl4.dtypes

In [148]:
cyl4_types

cylinders     int64
model_year    int64
dtype: object

cylinders is an int . . .

---------------------------

I'm going to go back to the assignment I was working on:

In [151]:
year_cyl.loc[[70,82]]

                       mpg  displacement  weight  acceleration  origin
model_year cylinders
70         4          25.3         107.0  2292.6          16.0     2.3
           6          20.5         199.0  2710.5          15.5     1.0
           8          14.1         367.6  3940.1          11.2     1.0
82         4          32.1         118.6  2402.3          16.7     1.7
           6          28.3         225.0  2931.7          16.0     1.0

In [154]:
 year_cyl.loc[(70,4)]

mpg               25.3
displacement     107.0
weight          2292.6
acceleration      16.0
origin             2.3
Name: (70, 4), dtype: float64

This seems like the same thing as doing:

In [155]:
year_cyl.loc[70].loc[4]

mpg               25.3
displacement     107.0
weight          2292.6
acceleration      16.0
origin             2.3
Name: 4, dtype: float64

It's very clear how to find the data for 4 cylinder cars from 1970 or cars from 1970 and 1982 for example, but it's not clear how to find cars from 1970 and 1982 which are 4 cylinders, for instance.

In [163]:
year_cyl.xs(key = 70, level = 'model_year')

            mpg  displacement  weight  acceleration  origin
cylinders
4          25.3         107.0  2292.6          16.0     2.3
6          20.5         199.0  2710.5          15.5     1.0
8          14.1         367.6  3940.1          11.2     1.0

This is a good way of grabbing things based on the iside index:

In [173]:
year_cyl.xs(key = 4, level = 'cylinders').loc[[70, 82]]

             mpg  displacement  weight  acceleration  origin
model_year
70          25.3         107.0  2292.6          16.0     2.3
82          32.1         118.6  2402.3          16.7     1.7

Finally ^ I was able to find a way to show 4 cylinder cars for the years 1970 and 1982. If I was trying to present this as an actual dataframe for some reason, I'd have to add a new column called cylinders again so that it would be more clear:

In [175]:
cyl4 = year_cyl.xs(key = 4, level = 'cylinders').loc[[70, 82]]

I'm just going to do this later and continue with the lecture

In [181]:
four_cyl = year_cyl.xs(key = 4, level = 'cylinders')
four_cyl.head()

             mpg  displacement  weight  acceleration  origin
model_year
70          25.3         107.0  2292.6          16.0     2.3
71          27.5         101.8  2056.4          17.0     1.9
72          23.4         111.5  2382.6          17.2     1.9
73          22.7         109.3  2338.1          17.1     2.0
74          27.8          96.5  2151.5          16.4     2.2

Aparently, the best practice is to create a new variable called four_cyl in this case so that it's clear that you're looking at just four cylinders now, since the table no longer contains that index

If you want to find just 6 and 8 cylinders, it's not possible to do this using .xs since it can only take 1 argument in key = x. It's therefore best to do that filtering before using .groupby(), and create a new table with just 6 and 8 cylinders:

In [184]:
cyl_6_8 = df[df['cylinders'].isin([6, 8])]

In [189]:
cyl_6_8.groupby(['model_year', 'cylinders']).mean().round(1).head(4)

                       mpg  displacement  weight  acceleration  origin
model_year cylinders
70         6          20.5         199.0  2710.5          15.5     1.0
           8          14.1         367.6  3940.1          11.2     1.0
71         6          18.0         243.4  3171.9          14.8     1.0
           8          13.4         371.7  4537.7          12.2     1.0

Now if I wanted to look at 8 cylinder cars from 1970:

In [196]:
#cyl_6_8.xs(key = 8, level = 'cylinders')

The error says that cyl_6_8 is not a MultiIndex. Let's see:

In [200]:
cyl_6_8.index

Int64Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
            ...
            360, 361, 362, 363, 364, 365, 366, 386, 387, 389],
           dtype='int64', length=187)

Ok, it's not a MultiIndex.

In [205]:
cyl_6_8[cyl_6_8['cylinders'].isin([8])].loc[70]

mpg                               13.0
cylinders                            8
displacement                     400.0
horsepower                         190
weight                            4422
acceleration                      12.5
model_year                          72
origin                               1
name            chrysler newport royal
Name: 70, dtype: object

Incredible. This is presumably the only 8 cylinder car from 1970 on this list.

In [208]:
year_cyl.swaplevel().head()

                       mpg  displacement  weight  acceleration  origin
cylinders model_year
4         70          25.3         107.0  2292.6          16.0     2.3
6         70          20.5         199.0  2710.5          15.5     1.0
8         70          14.1         367.6  3940.1          11.2     1.0
4         71          27.5         101.8  2056.4          17.0     1.9
6         71          18.0         243.4  3171.9          14.8     1.0

In [214]:
year_cyl.sort_index(level = 'model_year', ascending = False).head()

                       mpg  displacement  weight  acceleration  origin
model_year cylinders
82         6          28.3         225.0  2931.7          16.0     1.0
           4          32.1         118.6  2402.3          16.7     1.7
81         8          26.6         350.0  3725.0          19.0     1.0
           6          23.4         184.0  3093.6          15.4     1.7
           4          32.8         108.9  2275.5          16.5     2.1

Now it's in descending order for model_year

In [216]:
year_cyl.sort_index(level = 'cylinders', ascending = False).head()

                       mpg  displacement  weight  acceleration  origin
model_year cylinders
81         8          26.6         350.0  3725.0          19.0     1.0
79         8          18.6         321.4  3862.9          15.4     1.0
78         8          19.0         300.8  3563.3          13.3     1.0
77         8          16.0         335.8  4177.5          13.7     1.0
76         8          14.7         324.0  4064.7          13.2     1.0

^ The grouping together of model year and cylinders done by .groupby() has now been broken in order to sort cylinders this way

-------------------
Now for an 'advanced feature' which can be useful in certain specific circumstances:

In [218]:
df.head(3)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318.0,150,3436,11.0,70,1,plymouth satellite

The feature is the .agg() call which Patrick told me about yesterday. Now to see how it actually works:

In [219]:
df.agg(['std', 'mean'])

C:\Users\User\AppData\Local\Temp\ipykernel_7028\3018422473.py:1: FutureWarning: ['horsepower', 'name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.agg(['std', 'mean'])

,mpg,cylinders,displacement,weight,acceleration,model_year,origin
std,7.815984,1.701004,104.269838,846.841774,2.757689,3.697627,0.802055
mean,23.514573,5.454774,193.425879,2970.424623,15.568090,76.010050,1.572864

Ok, so part of the value of this .agg() call is that you can find the .mean() of one column, the .std() of another column, etc. For some columns, like model_year, taking the sum will never make sense. Maybe it would make sense to use .min() or .max() instead, but at the same time, you want to use .sum() for something else.

In [222]:
df.agg(['std', 'mean'])[['mpg', 'weight']].round(2)

C:\Users\User\AppData\Local\Temp\ipykernel_7028\2226939133.py:1: FutureWarning: ['horsepower', 'name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.agg(['std', 'mean'])[['mpg', 'weight']].round(2)

        mpg   weight
std    7.82   846.84
mean  23.51  2970.42

Since columns like origin don't make sense in this case, it's possible to filter in only useful columns using the above method ^

Now for the actual advanced method:

This uses a dictionary to apply certain statistics to certain columns

In [225]:
df.agg({'mpg': ['max', 'mean'], 'weight' : ['mean', 'std']}).round(2)

        mpg   weight
max   46.60      NaN
mean  23.51  2970.42
std     NaN   846.84

Now is an interesting case ^ where you'd have to fill in those missing points if this was going to be used by an AI. But probably you simply wouldn't use this method in the first place since it seems like it's more intended for general visualization of data in order to make it more clear by removing pointless data

Ok, the lecture man basically confirmed this. It's mostly a feature you'd use to remove pointless data for a report, etc., and based on the fact that he said we'd never use it again in the course, I assume that you wouldn't do this with a machine learning project.